Revit 2027 API
AreaLoad.ForceVector3 Property
 The force vector applied to the 3rd reference point of the area load, oriented according to OrientTo setting.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ ForceVector3 { get; set; }
Public Property ForceVector3 As XYZ
	Get
	Set
public:
property XYZ^ ForceVector3 {
	XYZ^ get ();
	void set (XYZ^ value);
}
member ForceVector3 : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 The default force unit is kN/m^2 for metric, and ksf for imperial. Use UnitUtils class methods to convert value from or to internal units.
See Also
Reference
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace